Repository: Saidsharaf/agri_guru
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Log In
ar: تسجيل الدخول

# msgLogin
source: sign in to your existing account
ar: سجل دخولك اذا كان لديك بالفعل حساب

source: EMAIL
ar: الايميل

# msgEmptyEmail
source: Email must not be empty
ar: الايميل لا يمكن ان يكون فارغًا

# msgValidEmail
source: Email must be valid
ar: الايميل يجب ان يكون صالحًا

source: PASSWORD
ar: كلمة المرور

# msgEmptyPassword
source: Password must not be empty
ar: كلمةالمرور لا يمكن ان تكون فارغة

# remember
source: Remember me
ar: تذكرني

# forgot
source: Forgot Password?
ar: نسيت كلمةالمرور

# logInBtn
source: Log in
ar: تسجيل الدخول

# doNot
source: Don't have an account?
ar: ليس لديك حساب ؟

source: SIGN UP
ar: سجل الآن

source: Or
ar: او

# signUpP
source: Sign Up
ar: إنشاء حساب

# msgSignUp
source: Please sign up to get start
ar: الرجاء ادخال البيانات للتسجيل

source: NAME
ar: الاسم

# msgEmptyName
source: Name must not be empty
ar: الاسم لا يجب ان يكون فارغًا

# emailR
source: EMAIL
ar: الايميل

# msgEmptyEmailR
source: Email must not be empty
ar: الايميل لا يجب ان يكون فارغًا

# msgValidEmailR
source: Please enter a valid email
ar: الرجاء ادخال ايميل صحيح

# passwordR
source: PASSWORD
ar: كلمةالمرور

# msgEmptyPasswordR
source: Password must not be empty
ar: كلمةالمرور لا يجب ان تكون فارغة

# rePass
source: RE-TYPE PASSWORD
ar: تأكيد كلمةالمرور

# msgRePass
source: doesn't match the password
ar: لا تطابق كلمةالمرور

# signUpBtn
source: Sign Up
ar: إنشاء حساب

# afterSignUpBtn
source: You have successfully sign up !.
ar: لقد قمت بالفعل ب إنشاء حساب

source: Hottest
ar: الأكثر مبيعًا

source: Popular
ar: شائع

# newP
source: New
ar: جديد

source: Gas sensor
ar: مستشعر الغاز

source: Soil moisture
ar: رطوبة التربة

source: Humidity
ar: مستشعر الرطوبة

source: Temperature
ar: مستشعر الحرارة

# topHome
source: Hello Wael,
ar: اهلاً وائل ،

# topHomeN
source: Which sensor do you want today ?
ar: ما هو المستشعر الذي تريده اليوم ؟

# topHomeNTwo
source: let's see the readings
ar: شاهد القراءات الحديثة

# search
source: Search for new sensors
ar: ابحث عن المستشعرات الجديدة

source: Recommended Sensors
ar: مستشعرات مرجحة

# sensorMsg
source: We deliver sensors with the faster way . Order for quickly today!!!
ar: نحن نوفر أجهزة الاستشعار بأسرع طريقة. اطلبها بسرعة اليوم!!!

# continueMsg
source: let's continue
ar: دعونا نستمر

source: Sensors
ar: المستشعرات

source: Recognize
ar: التعرف

source: Delivery
ar: التوصيل

source: Settings
ar: الإعدادات

# degree
source: Degrees
ar: درجات

# uploadGallary
source: Upload photo from gallary
ar: اختر الصوره من المعرض

# uploadCamera
source: Upload photo from camera
ar: اختر الصوره عن طريق الكاميرا

# selectPhoto
source: please select an image
ar: من فضلك اختار صوره

# randomAnswer1
source: Plant disease-resistant cultivars. If the fungus is prevalent, remove infected leaves or entire plants. Avoid overhead watering and irrigating plants in the evening. Rotate edible crops every year and avoid crowding plants
ar: ازرع أصنافًا مقاومة للأمراض. إذا كان الفطر منتشرًا، قم بإزالة الأوراق المصابة أو النباتات بأكملها. تجنب الري العلوي وري النباتات في المساء. قم بتناوب المحاصيل الصالحة للأكل كل عام وتجنب تكديس النباتات.

# randomAnswer2
source: Viral infections have no efficient control, but some resistant varieties exist. Remove infected plants immediately to prevent disease spread. The mosaic virus can survive in the soil for some period.
ar: لا توجد وسيلة فعالة للسيطرة على العدوى الفيروسية، ولكن هناك بعض الأصناف المقاومة. قم بإزالة النباتات المصابة على الفور لمنع انتشار المرض. يمكن لفيروس الفسيفساء البقاء على قيد الحياة في التربة لبعض الوقت.

# randomAnswer3
source: Give plants proper drainage and avoid planting in areas with poor air circulation and ample shade. Additionally, you can spray plants with a solution of baking soda and water. If fungus becomes established, remove infected leaves from plants to stop the spores from spreading. Commercial fungicides to treat powdery mildew are also available. For complete plant protection
ar: احرص على توفير الصرف المناسب للنباتات وتجنب الزراعة في المناطق التي تعاني من ضعف دوران الهواء والظل الكافي. بالإضافة إلى ذلك، يمكنك رش النباتات بمحلول من صودا الخبز والماء. إذا ترسخت الفطريات، قم بإزالة الأوراق المصابة من النباتات لمنع انتشار الجراثيم. تتوفر أيضًا مبيدات فطريات تجارية لعلاج العفن البودري. للحماية الكاملة للنباتات

# randomAnswer4
source: Plant resistant varieties in well-draining soil. The fungus spores overwinter in fallen leaves, so remove dead and infected leaves around the plants. Don't add them to the compost pile. Spray copper or sulfur-based fungicide in spring and early summer
ar: قم بزراعة أصناف مقاومة في تربة جيدة التصريف. تقضي جراثيم الفطريات فصل الشتاء في الأوراق المتساقطة، لذا قم بإزالة الأوراق الميتة والمصابة حول النباتات. لا تقم بإضافتها إلى كومة السماد. قم برش مبيد فطريات يحتوي على النحاس أو الكبريت في الربيع وأوائل الصيف.

# randomAnswer5
source: Plant disease-resistant cultivars. Once the disease infects a plant, there's no effective treatment. Remove and destroy affected plants immediately, and don't plant the same variety in that area for five years.
ar: ازرع أصنافًا مقاومة للأمراض. بمجرد إصابة النبات بالمرض، لا يوجد علاج فعال. قم بإزالة النباتات المصابة وتدميرها على الفور، ولا تزرع نفس الصنف في تلك المنطقة لمدة خمس سنوات.

# randomAnswer6
source: Prevention and good sanitation practices will help control this fungal disease because fungicides are not very effective, and there is no cure for an infected plant. Remove and destroy dead plants, including the infected roots and soil, and replant disease-resistant species. Avoid flooding or underwatering on mature trees. Furthermore
ar: إن الوقاية وممارسات الصرف الصحي الجيدة ستساعد في السيطرة على هذا المرض الفطري لأن مبيدات الفطريات ليست فعالة جدًا، ولا يوجد علاج للنبات المصاب. قم بإزالة النباتات الميتة وتدميرها، بما في ذلك الجذور المصابة والتربة، وأعد زراعة الأنواع المقاومة للمرض. تجنب الفيضانات أو نقص الري على الأشجار الناضجة. علاوة على ذلك

# deliveryName
source: salah mohamed
ar: صلاح محمد

source: Delivery man
ar: رجل التوصيل

# deliveryWay
source: On the way
ar: في الطريق

# deliveryAddress
source: 130 El Tahrir Street, Dokii, Giza, Egypt
ar: 130 شارع التحرير ، الدقي ، الجيزه، مصر

source: Order
ar: الطلب

# orderOne
source: Temperature Sensor
ar: مستشعر الحرارة

# orderPrice
source: 70 Le
ar: 70 جنيه

source: Total
ar: المجموع

# totalPrice
source: 140 Le
ar: 140 جنيه

source: Edit profile
ar: تعديل الملف الشخصي

source: Language
ar: اللغة

source: System
ar: النظام

source: Use System Theme
ar: استخدام النظام

source: Security
ar: الأمان

source: Use fingerprint
ar: استخدم بصمة الإصبع

source: Log out
ar: تسجيل الخروج

# basket
source: My Basket
ar: سلتي

source: Readings
ar: القراءات

source: Forget Password
ar: نسيت كلمةالمرور

# existAcc
source: sign in to your existing account
ar: تسجيل الدخول إلى حسابك الحالي

source: Send Code
ar: ارسل الكود

# msgSendCode
source: code send successfully
ar: تم ارسال الكود بنجاح

# msgSendCodeWrong
source: Something went wrong, write the code again!
ar: لقد حدث خطأ ما، قم بكتابة الكود مرة أخرى!

source: Verification Password
ar: التحقق من كلمة المرور

# msgVerificationPassword
source: We have sent a code to your email
ar: لقد أرسلنا لك رمزًا إلى بريدك الإلكتروني

# myName
source: wael saad
ar: وائل سعد
